SashaKyz/esp8266-plant-watering/src/main.cpp
#include <Arduino.h>
#include <Wire.h>
#include <ESP8266WebServer.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266WiFi.h>
#include <ESP8266mDNS.h>
#include <WiFiClient.h>
#include <EEPROM.h>
#include <Updater.h>
#include <Adafruit_ADS1X15.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
#include <time.h>

#include "config.h"
#include "dashboard.h"

namespace {

ESP8266WebServer server(80);
Adafruit_SSD1306 display(OLED_WIDTH, OLED_HEIGHT, &Wire, OLED_RESET_PIN);
Adafruit_ADS1115 ads;

struct Measurements {
  int16_t soilRaw = 0;
  int soilPercent = 0;
  bool soilValid = false;
  int batteryRaw = 0;
  float batteryVoltage = 0.0f;
  int batteryPercent = 0;
};

Measurements measurements;

enum class PumpSource : uint8_t {
  Soil,
  Schedule,
  Manual,
};

bool displayReady = false;
bool displayOn = false;
bool adsReady = false;
bool i2cBusAvailable = false;
bool apMode = false;
bool pumpRunning = false;
bool hasCompletedWatering = false;
bool fallbackScheduleTracking = false;
bool fallbackScheduleHasWatered = false;
bool otaInProgress = false;
bool otaUploadRejected = false;
bool otaRebootPending = false;
bool wokeFromDeepSleep = false;
bool wifiSleeping = false;
bool wifiWasConnected = false;
bool serverSyncDue = false;
uint8_t drySampleCount = 0;
uint8_t activeOledAddress = 0;
PumpSource lastPumpSource = PumpSource::Soil;

uint32_t pumpStartedAt = 0;
uint32_t lastPumpStoppedAt = 0;
uint32_t fallbackScheduleAnchorAt = 0;
uint32_t lastSensorAt = 0;
uint32_t lastDisplayAt = 0;
uint32_t lastOledActivityAt = 0;
uint32_t lastSerialAt = 0;
uint32_t wateringRunCount = 0;
uint32_t otaRebootAt = 0;
uint32_t pumpRunMs = PUMP_RUN_DEFAULT_MS;
uint32_t pauseStartedAt = 0;
uint32_t pauseDurationMs = 0;
uint32_t lastPersistentSaveAt = 0;
uint32_t wifiModeChangedAt = 0;
uint32_t lastServerSyncAt = 0;
uint32_t serverConfigVersion = 0;
uint32_t activeWateringCooldownMs = WATERING_COOLDOWN_MS;
uint32_t activeSensorIntervalMs = SENSOR_INTERVAL_MS;
uint32_t activeWifiOnWindowMs = WIFI_ON_WINDOW_MS;
uint32_t activeWifiOffWindowMs = WIFI_OFF_WINDOW_MS;
time_t wateringPausedUntil = 0;
time_t lastPumpStoppedAtEpoch = 0;
int lastServerTelemetryStatus = 0;
int lastServerConfigStatus = 0;
int lastServerOtaStatus = 0;
uint8_t activeSoilStartWateringPercent = SOIL_START_WATERING_PERCENT;
bool activeAutomaticWateringEnabled = AUTOMATIC_WATERING_ENABLED;
bool serverOtaUpdateAvailable = false;
uint32_t serverOtaSize = 0;
String serverOtaVersion;
String serverOtaUrl;
String serverOtaSha256;
String lastServerSyncMessage = "Server sync disabled";

constexpr uint32_t RTC_STATE_MAGIC = 0x50574D31;
struct RtcState {
  uint32_t magic;
  uint32_t pauseUntilEpoch;
};

constexpr uint32_t LEGACY_SETTINGS_MAGIC = 0x50575331;
struct LegacyPersistentSettings {
  uint32_t magic;
  uint32_t pumpRunMs;
  uint32_t checksum;
};

constexpr uint32_t PERSISTENT_STATE_MAGIC = 0x50575332;
constexpr uint32_t PERSISTENT_STATE_V3_MAGIC = 0x50575333;
constexpr size_t EEPROM_SIZE = 64;
struct PersistentState {
  uint32_t magic;
  uint32_t pumpRunMs;
  uint32_t wateringPausedUntilEpoch;
  uint32_t lastPumpStoppedEpoch;
  uint32_t wateringRunCount;
  uint32_t checksum;
};

struct PersistentStateV3 {
  uint32_t magic;
  uint32_t pumpRunMs;
  uint32_t wateringPausedUntilEpoch;
  uint32_t lastPumpStoppedEpoch;
  uint32_t wateringRunCount;
  uint32_t serverConfigVersion;
  uint32_t soilStartWateringPercent;
  uint32_t wateringCooldownMs;
  uint32_t sensorIntervalMs;
  uint32_t wifiOnWindowMs;
  uint32_t wifiOffWindowMs;
  uint32_t automaticWateringEnabled;
  uint32_t checksum;
};

String systemMessage = "Starting";

template <typename T>
T clampValue(T value, T minimum, T maximum) {
  return value < minimum ? minimum : (value > maximum ? maximum : value);
}

bool intervalElapsed(uint32_t now, uint32_t previous, uint32_t interval) {
  return static_cast<uint32_t>(now - previous) >= interval;
}

void wakeDisplay(uint32_t now) {
  if (!displayReady) {
    return;
  }
  lastOledActivityAt = now;
  if (!displayOn) {
    display.ssd1306_command(SSD1306_DISPLAYON);
    displayOn = true;
  }
}

void sleepDisplay() {
  if (!displayReady || !displayOn) {
    return;
  }
  display.ssd1306_command(SSD1306_DISPLAYOFF);
  displayOn = false;
}

bool timeIsSynced() {
  return time(nullptr) > 1700000000;
}

String formattedDateTime(time_t value = 0) {
  if (value == 0) {
    value = time(nullptr);
  }
  if (value <= 1700000000) {
    return String();
  }
  struct tm localTime;
  localtime_r(&value, &localTime);
  char buffer[24];
  strftime(buffer, sizeof(buffer), "%Y-%m-%d %H:%M:%S", &localTime);
  return String(buffer);
}

String formattedUtcDateTime(time_t value = 0) {
  if (value == 0) {
    value = time(nullptr);
  }
  if (value <= 1700000000) {
    return String();
  }
  struct tm utcTime;
  gmtime_r(&value, &utcTime);
  char buffer[24];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%SZ", &utcTime);
  return String(buffer);
}

String formattedOledDateTime() {
  if (!timeIsSynced()) {
    return F("Time: syncing...");
  }
  const time_t now = time(nullptr);
  struct tm localTime;
  localtime_r(&now, &localTime);
  char buffer[20];
  strftime(buffer, sizeof(buffer), "%m-%d %H:%M:%S", &localTime);
  return String(buffer);
}

String formattedDuration(uint32_t durationMs) {
  const uint32_t totalSeconds = (durationMs + 999U) / 1000U;
  char buffer[12];
  snprintf(buffer, sizeof(buffer), "%lu:%02lu",
           static_cast<unsigned long>(totalSeconds / 60U),
           static_cast<unsigned long>(totalSeconds % 60U));
  return String(buffer);
}

String formattedHoursMinutes(uint32_t durationMs) {
  const uint32_t totalMinutes = (durationMs + 59999U) / 60000U;
  char buffer[16];
  snprintf(buffer, sizeof(buffer), "%luh %02lum",
           static_cast<unsigned long>(totalMinutes / 60U),
           static_cast<unsigned long>(totalMinutes % 60U));
  return String(buffer);
}

uint32_t pumpElapsedMs(uint32_t now) {
  return pumpRunning ? static_cast<uint32_t>(now - pumpStartedAt) : 0;
}

uint32_t pumpRemainingMs(uint32_t now) {
  if (!pumpRunning) {
    return 0;
  }
  const uint32_t elapsed = pumpElapsedMs(now);
  return elapsed >= pumpRunMs ? 0 : pumpRunMs - elapsed;
}

