SashaKyz/esp8266-plant-watering/src/main.cpp
uint32_t cooldownRemainingMs(uint32_t now) {
  if (!hasCompletedWatering) {
    return 0;
  }
  if (lastPumpStoppedAtEpoch > 0 && timeIsSynced()) {
    const time_t current = time(nullptr);
    if (current <= lastPumpStoppedAtEpoch) {
      return activeWateringCooldownMs;
    }
    const uint64_t elapsedMs =
        static_cast<uint64_t>(current - lastPumpStoppedAtEpoch) * 1000ULL;
    return elapsedMs >= activeWateringCooldownMs
        ? 0
        : activeWateringCooldownMs - static_cast<uint32_t>(elapsedMs);
  }
  const uint32_t elapsed = static_cast<uint32_t>(now - lastPumpStoppedAt);
  return elapsed >= activeWateringCooldownMs
      ? 0
      : activeWateringCooldownMs - elapsed;
}

uint32_t startupPumpHoldRemainingMs(uint32_t now) {
  if (wokeFromDeepSleep) {
    return 0;
  }
  return now >= STARTUP_PUMP_HOLD_MS ? 0 : STARTUP_PUMP_HOLD_MS - now;
}

void saveRtcState() {
  RtcState state = {
      RTC_STATE_MAGIC, static_cast<uint32_t>(wateringPausedUntil)};
  ESP.rtcUserMemoryWrite(0, reinterpret_cast<uint32_t*>(&state),
                         sizeof(state));
}

void loadRtcState() {
  RtcState state = {};
  if (ESP.rtcUserMemoryRead(0, reinterpret_cast<uint32_t*>(&state),
                            sizeof(state)) &&
      state.magic == RTC_STATE_MAGIC) {
    wateringPausedUntil = static_cast<time_t>(state.pauseUntilEpoch);
  }
}

uint32_t legacySettingsChecksum(const LegacyPersistentSettings& settings) {
  return settings.magic ^ settings.pumpRunMs ^ 0xA5A55A5A;
}

uint32_t persistentStateChecksum(const PersistentState& state) {
  return state.magic ^ state.pumpRunMs ^ state.wateringPausedUntilEpoch ^
      state.lastPumpStoppedEpoch ^ state.wateringRunCount ^ 0x5A5AA5A5;
}

uint32_t persistentStateV3Checksum(const PersistentStateV3& state) {
  return state.magic ^ state.pumpRunMs ^ state.wateringPausedUntilEpoch ^
      state.lastPumpStoppedEpoch ^ state.wateringRunCount ^
      state.serverConfigVersion ^ state.soilStartWateringPercent ^
      state.wateringCooldownMs ^ state.sensorIntervalMs ^
      state.wifiOnWindowMs ^ state.wifiOffWindowMs ^
      state.automaticWateringEnabled ^ 0x33A55A33;
}

void savePersistentState() {
  PersistentStateV3 state = {
      PERSISTENT_STATE_V3_MAGIC,
      pumpRunMs,
      static_cast<uint32_t>(wateringPausedUntil),
      static_cast<uint32_t>(lastPumpStoppedAtEpoch),
      wateringRunCount,
      serverConfigVersion,
      activeSoilStartWateringPercent,
      activeWateringCooldownMs,
      activeSensorIntervalMs,
      activeWifiOnWindowMs,
      activeWifiOffWindowMs,
      activeAutomaticWateringEnabled ? 1U : 0U,
      0};
  state.checksum = persistentStateV3Checksum(state);
  EEPROM.put(0, state);
  EEPROM.commit();
  lastPersistentSaveAt = millis();
}

void loadPersistentState() {
  EEPROM.begin(EEPROM_SIZE);
  PersistentStateV3 stateV3 = {};
  EEPROM.get(0, stateV3);
  if (stateV3.magic == PERSISTENT_STATE_V3_MAGIC &&
      stateV3.checksum == persistentStateV3Checksum(stateV3)) {
    if (stateV3.pumpRunMs >= PUMP_RUN_MIN_MS &&
        stateV3.pumpRunMs <= PUMP_RUN_MAX_MS) {
      pumpRunMs = stateV3.pumpRunMs;
    }
    wateringPausedUntil = static_cast<time_t>(stateV3.wateringPausedUntilEpoch);
    lastPumpStoppedAtEpoch = static_cast<time_t>(stateV3.lastPumpStoppedEpoch);
    hasCompletedWatering = lastPumpStoppedAtEpoch > 0;
    wateringRunCount = stateV3.wateringRunCount;
    serverConfigVersion = stateV3.serverConfigVersion;
    activeSoilStartWateringPercent = static_cast<uint8_t>(
        clampValue<uint32_t>(stateV3.soilStartWateringPercent, 0, 100));
    activeWateringCooldownMs = stateV3.wateringCooldownMs;
    activeSensorIntervalMs = stateV3.sensorIntervalMs < 1000UL
        ? SENSOR_INTERVAL_MS
        : stateV3.sensorIntervalMs;
    activeWifiOnWindowMs = stateV3.wifiOnWindowMs < 1000UL
        ? WIFI_ON_WINDOW_MS
        : stateV3.wifiOnWindowMs;
    activeWifiOffWindowMs = stateV3.wifiOffWindowMs < 1000UL
        ? WIFI_OFF_WINDOW_MS
        : stateV3.wifiOffWindowMs;
    activeAutomaticWateringEnabled = stateV3.automaticWateringEnabled != 0;
    return;
  }

  PersistentState state = {};
  EEPROM.get(0, state);
  if (state.magic == PERSISTENT_STATE_MAGIC &&
      state.checksum == persistentStateChecksum(state)) {
    if (state.pumpRunMs >= PUMP_RUN_MIN_MS &&
        state.pumpRunMs <= PUMP_RUN_MAX_MS) {
      pumpRunMs = state.pumpRunMs;
    }
    wateringPausedUntil = static_cast<time_t>(state.wateringPausedUntilEpoch);
    lastPumpStoppedAtEpoch = static_cast<time_t>(state.lastPumpStoppedEpoch);
    hasCompletedWatering = lastPumpStoppedAtEpoch > 0;
    wateringRunCount = state.wateringRunCount;
    return;
  }

  LegacyPersistentSettings legacy = {};
  EEPROM.get(0, legacy);
  if (legacy.magic == LEGACY_SETTINGS_MAGIC &&
      legacy.checksum == legacySettingsChecksum(legacy) &&
      legacy.pumpRunMs >= PUMP_RUN_MIN_MS &&
      legacy.pumpRunMs <= PUMP_RUN_MAX_MS) {
    pumpRunMs = legacy.pumpRunMs;
    savePersistentState();
  }
}

uint32_t wateringPauseRemainingMs(uint32_t now) {
  if (wateringPausedUntil > 0) {
    if (!timeIsSynced()) {
      return UINT32_MAX;
    }
    const time_t current = time(nullptr);
    if (current >= wateringPausedUntil) {
      wateringPausedUntil = 0;
      saveRtcState();
      savePersistentState();
      return 0;
    }
    const uint64_t remaining =
        static_cast<uint64_t>(wateringPausedUntil - current) * 1000ULL;
    return remaining > UINT32_MAX ? UINT32_MAX
                                  : static_cast<uint32_t>(remaining);
  }
  if (pauseDurationMs == 0) {
    return 0;
  }
  const uint32_t elapsed = static_cast<uint32_t>(now - pauseStartedAt);
  if (elapsed >= pauseDurationMs) {
    pauseDurationMs = 0;
    return 0;
  }
  return pauseDurationMs - elapsed;
}

bool wateringPaused(uint32_t now) {
  return wateringPauseRemainingMs(now) > 0;
}

bool i2cAddressResponds(uint8_t address) {
  if (!i2cBusAvailable) {
    return false;
  }
  Wire.beginTransmission(address);
  return Wire.endTransmission() == 0;
}

bool checkI2cBusLines() {
  const int sdaState = digitalRead(I2C_SDA_PIN);
  const int sclState = digitalRead(I2C_SCL_PIN);
  Serial.printf("[I2C] SDA(D5/GPIO14)=%s SCL(D6/GPIO12)=%s\n",
                sdaState == HIGH ? "HIGH" : "LOW",
                sclState == HIGH ? "HIGH" : "LOW");
  if (sdaState == LOW || sclState == LOW) {
    Serial.println(
        F("[I2C] Bus stuck LOW; check swapped wires, shorts, and module power"));
    return false;
  }
  return true;
}

void scanI2cBus() {
  if (!i2cBusAvailable) {
    return;
  }
  Serial.println(F("[I2C] Scanning bus"));
  uint8_t count = 0;
  for (uint8_t address = 1; address < 127; ++address) {
    if (i2cAddressResponds(address)) {
      Serial.printf("[I2C] Device found at 0x%02X\n", address);
      ++count;
    }
    yield();
  }
  if (count == 0) {
    Serial.println(F("[I2C] No devices found; check power, ground, SDA, and SCL"));
  }
}

uint8_t detectOledAddress() {
  if (i2cAddressResponds(OLED_PREFERRED_ADDRESS)) {
    return OLED_PREFERRED_ADDRESS;
  }
  if (!OLED_AUTO_DETECT_ADDRESS) {
    return 0;
  }

  constexpr uint8_t commonAddresses[] = {0x3C, 0x3D};
  for (uint8_t address : commonAddresses) {
    if (address != OLED_PREFERRED_ADDRESS && i2cAddressResponds(address)) {
      return address;
    }
  }
  return 0;
}

const __FlashStringHelper* pumpSourceName(PumpSource source) {
  switch (source) {
    case PumpSource::Manual:
      return F("Manual");
    case PumpSource::Schedule:
      return F("Schedule");
    case PumpSource::Soil:
    default:
      return F("Soil");
  }
}

bool scheduleFallbackActive() {
  return activeAutomaticWateringEnabled && SENSORLESS_SCHEDULE_ENABLED &&
      !measurements.soilValid;
}

uint32_t scheduleRemainingMs(uint32_t now) {
  if (!scheduleFallbackActive() || !fallbackScheduleTracking) {
    return 0;
  }
  const uint32_t interval = fallbackScheduleHasWatered
      ? SENSORLESS_WATERING_INTERVAL_MS
      : SENSORLESS_FIRST_RUN_DELAY_MS;
  const uint32_t elapsed =
      static_cast<uint32_t>(now - fallbackScheduleAnchorAt);
  return elapsed >= interval ? 0 : interval - elapsed;
}

const __FlashStringHelper* controlModeName() {
  if (measurements.soilValid) {
    return F("Soil sensor");
  }
  return activeAutomaticWateringEnabled && SENSORLESS_SCHEDULE_ENABLED
      ? F("Scheduled fallback")
      : F("Manual only");
}

const __FlashStringHelper* controlModeShortName() {
  if (measurements.soilValid) {
    return F("SENSOR");
  }
  return scheduleFallbackActive() ? F("SCHEDULE") : F("MANUAL");
}

void writePump(bool enabled) {
  digitalWrite(PUMP_PIN, enabled == PUMP_ACTIVE_HIGH ? HIGH : LOW);
}

void setRgb(bool red, bool green, bool blue) {
  digitalWrite(LED_RED_PIN, red != LED_COMMON_ANODE ? HIGH : LOW);
  digitalWrite(LED_GREEN_PIN, green != LED_COMMON_ANODE ? HIGH : LOW);
  if (!DEEP_SLEEP_ENABLED) {
    digitalWrite(LED_BLUE_PIN, blue != LED_COMMON_ANODE ? HIGH : LOW);
  }
}

void updateStatusLed(uint32_t now) {
  if (pumpRunning) {
    setRgb(false, true, true);  // Cyan: pump active.
  } else if (measurements.batteryVoltage < BATTERY_PUMP_CUTOFF_V) {
    setRgb(true, false, false);  // Red: low battery.
  } else if (scheduleFallbackActive()) {
    setRgb(false, false, true);  // Blue: scheduled fallback.
  } else if (!adsReady || !measurements.soilValid) {
    setRgb(true, false, true);  // Magenta: sensor error, manual only.
  } else if (WiFi.status() != WL_CONNECTED && !apMode) {
    const bool blink = ((now / 500U) % 2U) == 0U;
    setRgb(false, false, blink);  // Blinking blue: connecting.
  } else if (measurements.soilPercent <= activeSoilStartWateringPercent) {
    setRgb(true, true, false);  // Yellow: dry or waiting for cooldown.
  } else {
    setRgb(false, true, false);  // Green: normal.
  }
}

int averageA0() {
  uint32_t total = 0;
  constexpr uint8_t sampleCount = 16;
  for (uint8_t i = 0; i < sampleCount; ++i) {
    total += analogRead(A0);
    delay(1);
  }
  return static_cast<int>(total / sampleCount);
}

int liIon18650Percent(float voltage) {
  struct VoltagePoint {
    float voltage;
    uint8_t percent;
  };
  constexpr VoltagePoint curve[] = {
      {3.20f, 0},  {3.40f, 5},  {3.50f, 10}, {3.60f, 20},
      {3.65f, 35}, {3.70f, 50}, {3.75f, 60}, {3.80f, 70},
      {3.90f, 80}, {4.00f, 90}, {4.10f, 96}, {4.20f, 100},
  };

