SashaKyz/esp8266-plant-watering/src/main.cpp
  if (voltage <= curve[0].voltage) {
    return curve[0].percent;
  }
  constexpr size_t pointCount = sizeof(curve) / sizeof(curve[0]);
  for (size_t i = 1; i < pointCount; ++i) {
    if (voltage <= curve[i].voltage) {
      const float position =
          (voltage - curve[i - 1].voltage) /
          (curve[i].voltage - curve[i - 1].voltage);
      return static_cast<int>(lroundf(
          curve[i - 1].percent +
          position * (curve[i].percent - curve[i - 1].percent)));
    }
  }
  return 100;
}

void readSensors() {
  measurements.batteryRaw = averageA0();
  measurements.batteryVoltage =
      (measurements.batteryRaw / 1023.0f) *
      BATTERY_ADC_FULL_SCALE_V * BATTERY_DIVIDER_RATIO;
  measurements.batteryPercent = liIon18650Percent(measurements.batteryVoltage);

  if (!adsReady) {
    measurements.soilValid = false;
    drySampleCount = 0;
    return;
  }

  measurements.soilRaw = ads.readADC_SingleEnded(SOIL_ADS_CHANNEL);
  const int32_t calibrationSpan =
      static_cast<int32_t>(SOIL_WET_RAW) - SOIL_DRY_RAW;
  measurements.soilValid =
      calibrationSpan != 0 && measurements.soilRaw >= 0;

  if (!measurements.soilValid) {
    drySampleCount = 0;
    return;
  }

  const float soilRatio =
      static_cast<float>(measurements.soilRaw - SOIL_DRY_RAW) /
      static_cast<float>(calibrationSpan);
  measurements.soilPercent =
      clampValue(static_cast<int>(lroundf(soilRatio * 100.0f)), 0, 100);

  if (measurements.soilPercent <= activeSoilStartWateringPercent) {
    if (drySampleCount < SOIL_DRY_CONFIRMATION_SAMPLES) {
      ++drySampleCount;
    }
  } else {
    drySampleCount = 0;
  }
}

bool startPump(PumpSource source) {
  if (pumpRunning) {
    systemMessage = "Pump is already running";
    return false;
  }
  const uint32_t startupHoldRemaining = startupPumpHoldRemainingMs(millis());
  if (startupHoldRemaining > 0) {
    systemMessage = "Pump held after startup for " +
        formattedDuration(startupHoldRemaining);
    return false;
  }
  if (wateringPaused(millis())) {
    systemMessage = "Watering is paused";
    return false;
  }
  if (measurements.batteryVoltage < BATTERY_PUMP_CUTOFF_V) {
    systemMessage = "Pump blocked: battery voltage is too low";
    return false;
  }

  lastPumpSource = source;
  pumpStartedAt = millis();
  wakeDisplay(pumpStartedAt);
  ++wateringRunCount;
  pumpRunning = true;
  writePump(true);
  switch (source) {
    case PumpSource::Manual:
      systemMessage = "Manual watering in progress";
      break;
    case PumpSource::Schedule:
      systemMessage = "Scheduled watering in progress";
      break;
    case PumpSource::Soil:
      systemMessage = "Soil-triggered watering in progress";
      break;
  }
  Serial.printf("[PUMP] Started (%s), duration=%lu ms\n",
                String(pumpSourceName(source)).c_str(),
                static_cast<unsigned long>(pumpRunMs));
  return true;
}

void stopPump(const __FlashStringHelper* reason) {
  if (!pumpRunning) {
    return;
  }
  writePump(false);
  pumpRunning = false;
  lastPumpStoppedAt = millis();
  lastPumpStoppedAtEpoch = timeIsSynced() ? time(nullptr) : 0;
  wakeDisplay(lastPumpStoppedAt);
  hasCompletedWatering = true;
  drySampleCount = 0;
  if (scheduleFallbackActive()) {
    fallbackScheduleTracking = true;
    fallbackScheduleHasWatered = true;
    fallbackScheduleAnchorAt = lastPumpStoppedAt;
  }
  systemMessage = String(reason);
  savePersistentState();
  Serial.printf("[PUMP] Stopped: %s\n", systemMessage.c_str());
}

void updatePumpControl(uint32_t now, bool evaluateAutomaticStart) {
  if (otaInProgress || otaRebootPending) {
    writePump(false);
    return;
  }
  if (pumpRunning) {
    if (pumpElapsedMs(now) >= pumpRunMs) {
      stopPump(F("Watering complete; soil is soaking"));
    } else if (measurements.batteryVoltage < BATTERY_PUMP_CUTOFF_V) {
      stopPump(F("Pump stopped: battery voltage became too low"));
    }
    return;
  }

  if (wateringPaused(now)) {
    return;
  }

  if (!activeAutomaticWateringEnabled) {
    return;
  }

  if (!measurements.soilValid) {
    if (!SENSORLESS_SCHEDULE_ENABLED) {
      fallbackScheduleTracking = false;
      return;
    }
    if (!fallbackScheduleTracking) {
      fallbackScheduleTracking = true;
      fallbackScheduleHasWatered = false;
      fallbackScheduleAnchorAt = now;
      systemMessage = "Soil unavailable; scheduled fallback active";
      Serial.printf("[SCHEDULE] Fallback enabled, first run in %lu ms\n",
                    static_cast<unsigned long>(
                        SENSORLESS_FIRST_RUN_DELAY_MS));
      return;
    }
    if (scheduleRemainingMs(now) > 0 || cooldownRemainingMs(now) > 0) {
      return;
    }
    startPump(PumpSource::Schedule);
    return;
  }

  fallbackScheduleTracking = false;
  fallbackScheduleHasWatered = false;
  if (!evaluateAutomaticStart ||
      drySampleCount < SOIL_DRY_CONFIRMATION_SAMPLES) {
    return;
  }
  if (cooldownRemainingMs(now) > 0) {
    systemMessage = "Soil is dry; waiting for soak cooldown";
    return;
  }
  startPump(PumpSource::Soil);
}

String wifiDescription() {
  if (apMode) {
    return "Setup access point";
  }
  if (wifiSleeping) {
    return "Wi-Fi sleeping";
  }
  return WiFi.status() == WL_CONNECTED ? "Wi-Fi connected"
                                       : "Wi-Fi disconnected";
}

String currentIp() {
  if (wifiSleeping) {
    return F("sleeping");
  }
  return apMode ? WiFi.softAPIP().toString() : WiFi.localIP().toString();
}

bool serverSyncConfigured() {
  return SERVER_SYNC_ENABLED && strlen(SERVER_BASE_URL) > 0;
}

String serverUrl(const __FlashStringHelper* pathSuffix) {
  String base = SERVER_BASE_URL;
  if (base.endsWith("/")) {
    base.remove(base.length() - 1);
  }
  String path = String(pathSuffix);
  path.replace("{deviceId}", DEVICE_ID);
  return base + path;
}

void addServerHeaders(HTTPClient& http) {
  http.addHeader(F("Content-Type"), F("application/json"));
  if (strlen(SERVER_API_TOKEN) > 0) {
    http.addHeader(F("Authorization"), String(F("Bearer ")) + SERVER_API_TOKEN);
  }
}

