SashaKyz/esp8266-plant-watering/src/main.cpp
String jsonStringValue(const String& value) {
  String escaped;
  escaped.reserve(value.length() + 4);
  escaped += '"';
  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value[i];
    if (c == '"' || c == '\\') {
      escaped += '\\';
    }
    escaped += c;
  }
  escaped += '"';
  return escaped;
}

bool findJsonValue(const String& json, const __FlashStringHelper* key,
                   int& valueStart) {
  const String needle = String('"') + String(key) + F("\"");
  const int keyIndex = json.indexOf(needle);
  if (keyIndex < 0) {
    return false;
  }
  const int colonIndex = json.indexOf(':', keyIndex + needle.length());
  if (colonIndex < 0) {
    return false;
  }
  valueStart = colonIndex + 1;
  while (valueStart < static_cast<int>(json.length()) &&
         isspace(json[valueStart])) {
    ++valueStart;
  }
  return valueStart < static_cast<int>(json.length());
}

bool jsonUInt(const String& json, const __FlashStringHelper* key,
              uint32_t& value) {
  int valueStart = 0;
  if (!findJsonValue(json, key, valueStart)) {
    return false;
  }
  char* end = nullptr;
  const unsigned long parsed = strtoul(json.c_str() + valueStart, &end, 10);
  if (end == json.c_str() + valueStart) {
    return false;
  }
  value = static_cast<uint32_t>(parsed);
  return true;
}

bool jsonBool(const String& json, const __FlashStringHelper* key,
              bool& value) {
  int valueStart = 0;
  if (!findJsonValue(json, key, valueStart)) {
    return false;
  }
  if (json.startsWith(F("true"), valueStart)) {
    value = true;
    return true;
  }
  if (json.startsWith(F("false"), valueStart)) {
    value = false;
    return true;
  }
  return false;
}

bool jsonString(const String& json, const __FlashStringHelper* key,
                String& value) {
  int valueStart = 0;
  if (!findJsonValue(json, key, valueStart) || json[valueStart] != '"') {
    return false;
  }
  ++valueStart;
  String parsed;
  for (int i = valueStart; i < static_cast<int>(json.length()); ++i) {
    const char c = json[i];
    if (c == '"') {
      value = parsed;
      return true;
    }
    if (c == '\\' && i + 1 < static_cast<int>(json.length())) {
      ++i;
    }
    parsed += json[i];
  }
  return false;
}

bool jsonNull(const String& json, const __FlashStringHelper* key) {
  int valueStart = 0;
  return findJsonValue(json, key, valueStart) &&
      json.startsWith(F("null"), valueStart);
}

int64_t daysFromCivil(int year, unsigned month, unsigned day) {
  year -= month <= 2;
  const int era = (year >= 0 ? year : year - 399) / 400;
  const unsigned yoe = static_cast<unsigned>(year - era * 400);
  const unsigned doy =
      (153 * (month + (month > 2 ? -3 : 9)) + 2) / 5 + day - 1;
  const unsigned doe = yoe * 365 + yoe / 4 - yoe / 100 + doy;
  return era * 146097LL + static_cast<int64_t>(doe) - 719468LL;
}

bool parseUtcTimestamp(const String& value, time_t& timestamp) {
  int year = 0;
  int month = 0;
  int day = 0;
  int hour = 0;
  int minute = 0;
  int second = 0;
  if (sscanf(value.c_str(), "%d-%d-%dT%d:%d:%dZ", &year, &month, &day,
             &hour, &minute, &second) != 6) {
    return false;
  }
  if (month < 1 || month > 12 || day < 1 || day > 31 || hour < 0 ||
      hour > 23 || minute < 0 || minute > 59 || second < 0 || second > 60) {
    return false;
  }
  const int64_t days = daysFromCivil(year, month, day);
  timestamp = static_cast<time_t>(
      days * 86400LL + hour * 3600L + minute * 60L + second);
  return true;
}

void noteWifiActivity(uint32_t now) {
  if (!PERIODIC_WIFI_SLEEP_ENABLED || apMode) {
    return;
  }
  wifiModeChangedAt = now;
}

void sleepWifi(uint32_t now) {
  if (wifiSleeping || apMode) {
    return;
  }
  MDNS.close();
  WiFi.disconnect();
  WiFi.mode(WIFI_OFF);
  WiFi.forceSleepBegin();
  delay(1);
  wifiSleeping = true;
  wifiWasConnected = false;
  wifiModeChangedAt = now;
  systemMessage = "Wi-Fi sleeping to save battery";
  Serial.println(F("[WIFI] Sleeping"));
}

void wakeWifi(uint32_t now) {
  if (!wifiSleeping) {
    return;
  }
  WiFi.forceSleepWake();
  delay(1);
  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  WiFi.hostname(HOSTNAME);
  WiFi.setAutoReconnect(true);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
  wifiSleeping = false;
  wifiModeChangedAt = now;
  systemMessage = "Wi-Fi waking";
  Serial.printf("[WIFI] Waking, connecting to %s\n", WIFI_SSID);
}

void updateWifiPower(uint32_t now) {
  if (!PERIODIC_WIFI_SLEEP_ENABLED || apMode || otaInProgress ||
      otaRebootPending) {
    return;
  }

  if (wifiSleeping) {
    if (intervalElapsed(now, wifiModeChangedAt, activeWifiOffWindowMs)) {
      wakeWifi(now);
    }
    return;
  }

  const bool connected = WiFi.status() == WL_CONNECTED;
  if (connected && !wifiWasConnected) {
    wifiWasConnected = true;
    wifiModeChangedAt = now;
    configTime(TIMEZONE, NTP_SERVER_1, NTP_SERVER_2);
    if (MDNS.begin(HOSTNAME)) {
      MDNS.addService("http", "tcp", 80);
    }
    if (serverSyncConfigured()) {
      serverSyncDue = true;
    }
    Serial.printf("[WIFI] Connected, IP=%s\n",
                  WiFi.localIP().toString().c_str());
  } else if (!connected && wifiWasConnected) {
    wifiWasConnected = false;
  }

  const uint32_t window = connected ? activeWifiOnWindowMs
                                    : WIFI_CONNECT_TIMEOUT_MS;
  if (intervalElapsed(now, wifiModeChangedAt, window)) {
    sleepWifi(now);
  }
}

uint32_t wifiNextTransitionMs(uint32_t now) {
  if (!PERIODIC_WIFI_SLEEP_ENABLED || apMode) {
    return 0;
  }
  const uint32_t window = wifiSleeping
      ? activeWifiOffWindowMs
      : (WiFi.status() == WL_CONNECTED ? activeWifiOnWindowMs
                                       : WIFI_CONNECT_TIMEOUT_MS);
  const uint32_t elapsed = static_cast<uint32_t>(now - wifiModeChangedAt);
  return elapsed >= window ? 0 : window - elapsed;
}

String telemetryJson(uint32_t now) {
  const uint32_t pauseRemaining = wateringPauseRemainingMs(now);
  const String timestamp = formattedUtcDateTime();
  const String currentDateTime = formattedDateTime();
  String json;
  json.reserve(760);
  json += F("{\"deviceId\":");
  json += jsonStringValue(DEVICE_ID);
  json += F(",\"timestamp\":");
  json += timestamp.length() == 0 ? F("null") : jsonStringValue(timestamp);
  json += F(",\"currentDateTime\":");
  json += currentDateTime.length() == 0 ? F("null") : jsonStringValue(currentDateTime);
  json += F(",\"soilPercent\":");
  json += measurements.soilPercent;
  json += F(",\"soilRaw\":");
  json += measurements.soilRaw;
  json += F(",\"soilValid\":");
  json += measurements.soilValid ? F("true") : F("false");
  json += F(",\"batteryVoltage\":");
  json += String(measurements.batteryVoltage, 3);
  json += F(",\"batteryPercent\":");
  json += measurements.batteryPercent;
  json += F(",\"batteryRaw\":");
  json += measurements.batteryRaw;
  json += F(",\"pumpRunning\":");
  json += pumpRunning ? F("true") : F("false");
  json += F(",\"pumpDurationMs\":");
  json += pumpRunMs;
  json += F(",\"pumpRemainingMs\":");
  json += pumpRemainingMs(now);
  json += F(",\"wateringRunCount\":");
  json += wateringRunCount;
  json += F(",\"wateringPaused\":");
  json += pauseRemaining > 0 ? F("true") : F("false");
  json += F(",\"wateringPauseUntil\":");
  json += wateringPausedUntil > 0 ? jsonStringValue(formattedUtcDateTime(wateringPausedUntil)) : F("null");
  json += F(",\"controlMode\":");
  json += jsonStringValue(String(controlModeName()));
  json += F(",\"wifiRssi\":");
  json += WiFi.status() == WL_CONNECTED ? String(WiFi.RSSI()) : F("null");
  json += F(",\"uptimeMs\":");
  json += now;
  json += F(",\"firmwareVersion\":");
  json += jsonStringValue(FIRMWARE_VERSION);
  json += F("}");
  return json;
}

void postTelemetryToServer(uint32_t now) {
  WiFiClient client;
  HTTPClient http;
  const String url = serverUrl(F("/api/devices/{deviceId}/telemetry"));
  if (!http.begin(client, url)) {
    lastServerTelemetryStatus = -1;
    lastServerSyncMessage = "Telemetry begin failed";
    return;
  }
  http.setTimeout(SERVER_HTTP_TIMEOUT_MS);
  addServerHeaders(http);
  const String payload = telemetryJson(now);
  lastServerTelemetryStatus = http.POST(payload);
  lastServerSyncMessage = lastServerTelemetryStatus > 0
      ? "Telemetry POST status " + String(lastServerTelemetryStatus)
      : "Telemetry POST failed " + String(lastServerTelemetryStatus);
  http.end();
  yield();
}

