SashaKyz/esp8266-plant-watering/src/main.cpp
bool applyServerConfig(const String& body) {
  uint32_t version = 0;
  if (!jsonUInt(body, F("version"), version) ||
      version <= serverConfigVersion) {
    return false;
  }

  uint32_t value = 0;
  if (jsonUInt(body, F("pumpDurationMs"), value) &&
      value >= PUMP_RUN_MIN_MS && value <= PUMP_RUN_MAX_MS) {
    pumpRunMs = value;
  }
  if (jsonUInt(body, F("soilStartWateringPercent"), value)) {
    activeSoilStartWateringPercent =
        static_cast<uint8_t>(clampValue<uint32_t>(value, 0, 100));
  }
  if (jsonUInt(body, F("wateringCooldownMs"), value)) {
    activeWateringCooldownMs = value;
  }
  if (jsonUInt(body, F("sensorIntervalMs"), value) && value >= 1000UL) {
    activeSensorIntervalMs = value;
  }
  if (jsonUInt(body, F("wifiOnWindowMs"), value) && value >= 1000UL) {
    activeWifiOnWindowMs = value;
  }
  if (jsonUInt(body, F("wifiOffWindowMs"), value) && value >= 1000UL) {
    activeWifiOffWindowMs = value;
  }
  bool boolValue = false;
  if (jsonBool(body, F("automaticWateringEnabled"), boolValue)) {
    activeAutomaticWateringEnabled = boolValue;
  }
  if (jsonNull(body, F("wateringPausedUntil"))) {
    wateringPausedUntil = 0;
    pauseDurationMs = 0;
  } else {
    String pauseUntil;
    time_t parsedPauseUntil = 0;
    if (jsonString(body, F("wateringPausedUntil"), pauseUntil) &&
        parseUtcTimestamp(pauseUntil, parsedPauseUntil)) {
      wateringPausedUntil = parsedPauseUntil;
      pauseDurationMs = 0;
    }
  }

  serverConfigVersion = version;
  saveRtcState();
  savePersistentState();
  systemMessage = "Applied server config v" + String(serverConfigVersion);
  Serial.printf("[SERVER] Applied config version %lu\n",
                static_cast<unsigned long>(serverConfigVersion));
  return true;
}

void pullConfigFromServer() {
  WiFiClient client;
  HTTPClient http;
  const String url = serverUrl(F("/api/devices/{deviceId}/config"));
  if (!http.begin(client, url)) {
    lastServerConfigStatus = -1;
    lastServerSyncMessage = "Config begin failed";
    return;
  }
  http.setTimeout(SERVER_HTTP_TIMEOUT_MS);
  addServerHeaders(http);
  lastServerConfigStatus = http.GET();
  if (lastServerConfigStatus == HTTP_CODE_OK) {
    const String body = http.getString();
    const bool applied = applyServerConfig(body);
    lastServerSyncMessage = applied
        ? "Config applied v" + String(serverConfigVersion)
        : "Config unchanged v" + String(serverConfigVersion);
  } else {
    lastServerSyncMessage = "Config GET status " + String(lastServerConfigStatus);
  }
  http.end();
  yield();
}

void checkOtaManifestFromServer() {
  WiFiClient client;
  HTTPClient http;
  const String url = serverUrl(F("/api/devices/{deviceId}/ota"));
  if (!http.begin(client, url)) {
    lastServerOtaStatus = -1;
    lastServerSyncMessage = "OTA begin failed";
    return;
  }
  http.setTimeout(SERVER_HTTP_TIMEOUT_MS);
  addServerHeaders(http);
  lastServerOtaStatus = http.GET();
  if (lastServerOtaStatus == HTTP_CODE_OK) {
    const String body = http.getString();
    bool updateAvailable = false;
    serverOtaUpdateAvailable =
        jsonBool(body, F("updateAvailable"), updateAvailable) && updateAvailable;
    serverOtaVersion = String();
    serverOtaUrl = String();
    serverOtaSha256 = String();
    serverOtaSize = 0;
    if (serverOtaUpdateAvailable) {
      jsonString(body, F("version"), serverOtaVersion);
      jsonString(body, F("firmwareUrl"), serverOtaUrl);
      jsonString(body, F("sha256"), serverOtaSha256);
      jsonUInt(body, F("size"), serverOtaSize);
      lastServerSyncMessage = "OTA available " + serverOtaVersion;
      Serial.printf("[SERVER] OTA available version=%s size=%lu url=%s\n",
                    serverOtaVersion.c_str(),
                    static_cast<unsigned long>(serverOtaSize),
                    serverOtaUrl.c_str());
    }
  } else {
    lastServerSyncMessage = "OTA GET status " + String(lastServerOtaStatus);
  }
  http.end();
  yield();
}

void syncWithServer(uint32_t now, bool force = false) {
  if (!serverSyncConfigured()) {
    lastServerSyncMessage = "Server sync disabled";
    return;
  }
  if (wifiSleeping || apMode || WiFi.status() != WL_CONNECTED) {
    return;
  }
  if (pumpRunning || otaInProgress || otaRebootPending) {
    return;
  }
  if (!force &&
      !intervalElapsed(now, lastServerSyncAt, SERVER_SYNC_INTERVAL_MS)) {
    return;
  }
  lastServerSyncAt = now;
  postTelemetryToServer(now);
  if (!pumpRunning && !otaInProgress && !otaRebootPending) {
    pullConfigFromServer();
  }
  if (!pumpRunning && !otaInProgress && !otaRebootPending) {
    checkOtaManifestFromServer();
  }
}

String statusJson() {
  const uint32_t now = millis();
  const uint32_t nextScheduledMs = scheduleRemainingMs(now);
  const uint32_t pauseRemaining = wateringPauseRemainingMs(now);
  String nextScheduledDateTime;
  if (timeIsSynced() && scheduleFallbackActive()) {
    nextScheduledDateTime =
        formattedDateTime(time(nullptr) + ((nextScheduledMs + 999U) / 1000U));
  }
  String json;
  json.reserve(720);
  json += F("{\"wifi\":\"");
  json += wifiDescription();
  json += F("\",\"wifiSleeping\":");
  json += wifiSleeping ? F("true") : F("false");
  json += F(",\"wifiNextTransitionMs\":");
  json += wifiNextTransitionMs(now);
  json += F(",\"serverSyncEnabled\":");
  json += serverSyncConfigured() ? F("true") : F("false");
  json += F(",\"lastServerTelemetryStatus\":");
  json += lastServerTelemetryStatus;
  json += F(",\"lastServerConfigStatus\":");
  json += lastServerConfigStatus;
  json += F(",\"lastServerOtaStatus\":");
  json += lastServerOtaStatus;
  json += F(",\"serverConfigVersion\":");
  json += serverConfigVersion;
  json += F(",\"serverOtaUpdateAvailable\":");
  json += serverOtaUpdateAvailable ? F("true") : F("false");
  json += F(",\"serverOtaVersion\":");
  json += jsonStringValue(serverOtaVersion);
  json += F(",\"serverOtaSize\":");
  json += serverOtaSize;
  json += F(",\"lastServerSyncMessage\":");
  json += jsonStringValue(lastServerSyncMessage);
  json += F(",\"ip\":\"");
  json += currentIp();
  json += F("\",\"soilValid\":");
  json += measurements.soilValid ? F("true") : F("false");
  json += F(",\"soilRaw\":");
  json += measurements.soilRaw;
  json += F(",\"soilPercent\":");
  json += measurements.soilPercent;
  json += F(",\"batteryRaw\":");
  json += measurements.batteryRaw;
  json += F(",\"batteryVoltage\":");
  json += String(measurements.batteryVoltage, 3);
  json += F(",\"batteryPercent\":");
  json += measurements.batteryPercent;
  json += F(",\"pumpRunning\":");
  json += pumpRunning ? F("true") : F("false");
  json += F(",\"pumpSource\":\"");
  json += wateringRunCount == 0 ? F("None") : pumpSourceName(lastPumpSource);
  json += F("\",\"pumpRemainingMs\":");
  json += pumpRemainingMs(now);
  json += F(",\"pumpElapsedMs\":");
  json += pumpElapsedMs(now);
  json += F(",\"pumpDurationMs\":");
  json += pumpRunMs;
  json += F(",\"soilStartWateringPercent\":");
  json += activeSoilStartWateringPercent;
  json += F(",\"wateringCooldownMs\":");
  json += activeWateringCooldownMs;
  json += F(",\"sensorIntervalMs\":");
  json += activeSensorIntervalMs;
  json += F(",\"wifiOnWindowMs\":");
  json += activeWifiOnWindowMs;
  json += F(",\"wifiOffWindowMs\":");
  json += activeWifiOffWindowMs;
  json += F(",\"wateringRunCount\":");
  json += wateringRunCount;
  json += F(",\"cooldownRemainingMs\":");
  json += cooldownRemainingMs(now);
  json += F(",\"startupPumpHoldRemainingMs\":");
  json += startupPumpHoldRemainingMs(now);
  json += F(",\"wateringPaused\":");
  json += pauseRemaining > 0 ? F("true") : F("false");
  json += F(",\"wateringPauseRemainingMs\":");
  json += pauseRemaining == UINT32_MAX ? 0 : pauseRemaining;
  json += F(",\"wateringPauseUntil\":\"");
  json += wateringPausedUntil > 0 ? formattedDateTime(wateringPausedUntil)
                                  : String();
  json += F("\"");
  json += F(",\"automaticEnabled\":");
  json += activeAutomaticWateringEnabled ? F("true") : F("false");
  json += F(",\"controlMode\":\"");
  json += controlModeName();
  json += F("\",\"scheduleFallbackActive\":");
  json += scheduleFallbackActive() ? F("true") : F("false");
  json += F(",\"nextScheduledWateringMs\":");
  json += nextScheduledMs;
  json += F(",\"nextScheduledDateTime\":\"");
  json += nextScheduledDateTime;
  json += F("\",\"timeSynced\":");
  json += timeIsSynced() ? F("true") : F("false");
  json += F(",\"currentDateTime\":\"");
  json += formattedDateTime();
  json += F("\"");
  json += F(",\"oledReady\":");
  json += displayReady ? F("true") : F("false");
  json += F(",\"oledAddress\":");
  json += activeOledAddress;
  json += F(",\"uptimeMs\":");
  json += now;
  json += F(",\"message\":\"");
  json += systemMessage;
  json += F("\"}");
  return json;
}

String prometheusMetrics() {
  const uint32_t now = millis();
  const uint32_t pauseRemaining = wateringPauseRemainingMs(now);
  String metrics;
  metrics.reserve(1400);
  metrics += F("# TYPE plant_soil_moisture_percent gauge\nplant_soil_moisture_percent ");
  metrics += measurements.soilPercent;
  metrics += '\n';
  metrics += F("# TYPE plant_soil_raw gauge\nplant_soil_raw ");
  metrics += measurements.soilRaw;
  metrics += '\n';
  metrics += F("# TYPE plant_soil_sensor_valid gauge\nplant_soil_sensor_valid ");
  metrics += measurements.soilValid ? '1' : '0';
  metrics += '\n';
  metrics += F("# TYPE plant_battery_voltage_volts gauge\nplant_battery_voltage_volts ");
  metrics += String(measurements.batteryVoltage, 3);
  metrics += '\n';
  metrics += F("# TYPE plant_battery_charge_percent gauge\nplant_battery_charge_percent ");
  metrics += measurements.batteryPercent;
  metrics += '\n';
  metrics += F("# TYPE plant_pump_running gauge\nplant_pump_running ");
  metrics += pumpRunning ? '1' : '0';
  metrics += '\n';
  metrics += F("# TYPE plant_watering_runs_total counter\nplant_watering_runs_total ");
  metrics += wateringRunCount;
  metrics += '\n';
  metrics += F("# TYPE plant_watering_paused gauge\nplant_watering_paused ");
  metrics += pauseRemaining > 0 ? '1' : '0';
  metrics += '\n';
  metrics += F("# TYPE plant_watering_pause_remaining_seconds gauge\nplant_watering_pause_remaining_seconds ");
  metrics += pauseRemaining == UINT32_MAX ? 0 : pauseRemaining / 1000U;
  metrics += '\n';
  metrics += F("# TYPE plant_pump_remaining_seconds gauge\nplant_pump_remaining_seconds ");
  metrics += pumpRemainingMs(now) / 1000U;
  metrics += '\n';
  metrics += F("# TYPE plant_pump_duration_seconds gauge\nplant_pump_duration_seconds ");
  metrics += pumpRunMs / 1000U;
  metrics += '\n';
  metrics += F("# TYPE plant_cooldown_remaining_seconds gauge\nplant_cooldown_remaining_seconds ");
  metrics += cooldownRemainingMs(now) / 1000U;
  metrics += '\n';
  metrics += F("# TYPE plant_controller_uptime_seconds counter\nplant_controller_uptime_seconds ");
  metrics += now / 1000U;
  metrics += '\n';
  metrics += F("# TYPE plant_wifi_sleeping gauge\nplant_wifi_sleeping ");
  metrics += wifiSleeping ? '1' : '0';
  metrics += '\n';
  metrics += F("# TYPE plant_wifi_next_transition_seconds gauge\nplant_wifi_next_transition_seconds ");
  metrics += wifiNextTransitionMs(now) / 1000U;
  metrics += '\n';
  metrics += F("# TYPE plant_server_config_version gauge\nplant_server_config_version ");
  metrics += serverConfigVersion;
  metrics += '\n';
  metrics += F("# TYPE plant_server_ota_update_available gauge\nplant_server_ota_update_available ");
  metrics += serverOtaUpdateAvailable ? '1' : '0';
  metrics += '\n';
  return metrics;
}

void setupWebServer() {
  server.on("/", HTTP_GET, []() {
    const uint32_t now = millis();
    wakeDisplay(now);
    noteWifiActivity(now);
    server.send_P(200, "text/html", DASHBOARD_HTML);
  });
  server.on("/api/status", HTTP_GET, []() {
    server.send(200, "application/json", statusJson());
  });
  server.on("/metrics", HTTP_GET, []() {
    server.send(200, "text/plain; version=0.0.4; charset=utf-8",
                prometheusMetrics());
  });
  server.on("/pump", HTTP_POST, []() {
    const uint32_t now = millis();
    wakeDisplay(now);
    noteWifiActivity(now);
    const bool started = startPump(PumpSource::Manual);
    String response = F("{\"started\":");
    response += started ? F("true") : F("false");
    response += F(",\"message\":\"");
    response += systemMessage;
    response += F("\"}");
    server.send(started ? 202 : 409, "application/json", response);
  });
  server.on("/pump/stop", HTTP_POST, []() {
    const uint32_t now = millis();
    wakeDisplay(now);
    noteWifiActivity(now);
    const bool wasRunning = pumpRunning;
    if (wasRunning) {
      stopPump(F("Watering stopped manually"));
    } else {
      systemMessage = "Pump is already stopped";
    }
    String response = F("{\"stopped\":");
    response += wasRunning ? F("true") : F("false");
    response += F(",\"message\":\"");
    response += systemMessage;
    response += F("\"}");
    server.send(wasRunning ? 200 : 409, "application/json", response);
  });
  server.on("/pause", HTTP_POST, []() {
    const uint32_t now = millis();
    wakeDisplay(now);
    noteWifiActivity(now);
    const int hours = static_cast<int>(
        clampValue(server.arg("hours").toInt(), 0L, 24L));
    if (pumpRunning) {
      stopPump(F("Watering stopped and paused"));
    }
    if (hours == 0) {
      wateringPausedUntil = 0;
      pauseDurationMs = 0;
      systemMessage = "Watering pause cleared";
    } else if (timeIsSynced()) {
      wateringPausedUntil = time(nullptr) + hours * 3600L;
      pauseDurationMs = 0;
      systemMessage = "Watering paused for " + String(hours) + " hours";
    } else {
      wateringPausedUntil = 0;
      pauseStartedAt = millis();
      pauseDurationMs = static_cast<uint32_t>(hours) * 60UL * 60UL * 1000UL;
      systemMessage = "Watering paused for " + String(hours) + " hours";
    }
    saveRtcState();
    savePersistentState();
    server.send(200, "application/json", statusJson());
  });
  server.on("/settings/pump-duration", HTTP_POST, []() {
    const uint32_t now = millis();
    wakeDisplay(now);
    noteWifiActivity(now);
    const long requestedSeconds = server.arg("seconds").toInt();
    const long minSeconds = PUMP_RUN_MIN_MS / 1000UL;
    const long maxSeconds = PUMP_RUN_MAX_MS / 1000UL;
    if (requestedSeconds < minSeconds || requestedSeconds > maxSeconds) {
      server.send(400, "application/json",
                  "{\"error\":\"Duration must be between 5 and 300 seconds\"}");
      return;
    }
    if (pumpRunning) {
      server.send(409, "application/json",
                  "{\"error\":\"Stop the pump before changing duration\"}");
      return;
    }
    pumpRunMs = static_cast<uint32_t>(requestedSeconds) * 1000UL;
    savePersistentState();
    systemMessage = "Pump duration set to " + String(requestedSeconds) +
        " seconds";
    server.send(200, "application/json", statusJson());
  });
  server.on("/update", HTTP_GET, []() {
    const uint32_t now = millis();
    wakeDisplay(now);
    noteWifiActivity(now);
    if (!server.authenticate(OTA_USERNAME, OTA_PASSWORD)) {
      server.requestAuthentication();
      return;
    }
    server.send_P(200, "text/html", UPDATE_HTML);
  });
  server.on(
      "/update", HTTP_POST,
      []() {
        if (!server.authenticate(OTA_USERNAME, OTA_PASSWORD)) {
          server.requestAuthentication();
          return;
        }

        otaInProgress = false;
        if (otaUploadRejected) {
          server.send(pumpRunning ? 409 : 400, "text/plain",
                      pumpRunning ? "Stop watering before updating."
                                  : "Firmware upload failed. Check serial output.");
          return;
        }
        if (Update.hasError()) {
          server.send(500, "text/plain",
                      "Firmware validation or flash write failed.");
          return;
        }

