SashaKyz/esp8266-plant-watering/src/main.cpp
        systemMessage = "Firmware updated; restarting";
        wakeDisplay(millis());
        server.send(200, "text/html",
                    "<h1>Update complete</h1><p>The controller is restarting.</p>");
        otaRebootPending = true;
        otaRebootAt = millis();
        Serial.println(F("[OTA] Update complete; restart scheduled"));
      },
      []() {
        HTTPUpload& upload = server.upload();
        if (upload.status == UPLOAD_FILE_START) {
          otaUploadRejected =
              !server.authenticate(OTA_USERNAME, OTA_PASSWORD) || pumpRunning;
          if (otaUploadRejected) {
            Serial.println(pumpRunning
                               ? F("[OTA] Rejected while pump is running")
                               : F("[OTA] Rejected unauthenticated upload"));
            return;
          }

          writePump(false);
          otaInProgress = true;
          systemMessage = "Firmware update in progress";
          wakeDisplay(millis());
          const uint32_t maxSketchSpace =
              (ESP.getFreeSketchSpace() - 0x1000U) & 0xFFFFF000U;
          Serial.printf("[OTA] Upload started: %s, capacity=%lu bytes\n",
                        upload.filename.c_str(),
                        static_cast<unsigned long>(maxSketchSpace));
          if (!Update.begin(maxSketchSpace, U_FLASH)) {
            Update.printError(Serial);
            otaUploadRejected = true;
            otaInProgress = false;
          }
        } else if (upload.status == UPLOAD_FILE_WRITE) {
          if (!otaUploadRejected &&
              Update.write(upload.buf, upload.currentSize) !=
                  upload.currentSize) {
            Update.printError(Serial);
            otaUploadRejected = true;
          }
        } else if (upload.status == UPLOAD_FILE_END) {
          if (!otaUploadRejected && !Update.end(true)) {
            Update.printError(Serial);
            otaUploadRejected = true;
          }
          otaInProgress = false;
          Serial.printf("[OTA] Received %lu bytes, result=%s\n",
                        static_cast<unsigned long>(upload.totalSize),
                        otaUploadRejected ? "failed" : "success");
        } else if (upload.status == UPLOAD_FILE_ABORTED) {
          Update.end();
          otaUploadRejected = true;
          otaInProgress = false;
          systemMessage = "Firmware update aborted";
          Serial.println(F("[OTA] Upload aborted"));
        }
        yield();
      });
  server.onNotFound([]() {
    server.send(404, "text/plain", "Not found");
  });
  server.begin();
  Serial.println(F("[WEB] HTTP server started"));
}

void showStartupMessage(const __FlashStringHelper* line1,
                        const String& line2 = String()) {
  if (!displayReady) {
    return;
  }
  wakeDisplay(millis());
  display.clearDisplay();
  display.setCursor(0, 0);
  display.println(line1);
  display.println(line2);
  display.display();
}

void connectNetwork() {
  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  WiFi.hostname(HOSTNAME);
  WiFi.setAutoReconnect(true);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  Serial.printf("[WIFI] Connecting to %s", WIFI_SSID);
  showStartupMessage(F("Connecting Wi-Fi"), WIFI_SSID);
  const uint32_t startedAt = millis();
  while (WiFi.status() != WL_CONNECTED &&
         !intervalElapsed(millis(), startedAt, 20000)) {
    Serial.print('.');
    updateStatusLed(millis());
    delay(250);
  }
  Serial.println();

  if (WiFi.status() == WL_CONNECTED) {
    apMode = false;
    wifiSleeping = false;
    wifiWasConnected = true;
    wifiModeChangedAt = millis();
    systemMessage = "Controller ready";
    Serial.printf("[WIFI] Connected, IP=%s\n",
                  WiFi.localIP().toString().c_str());
    showStartupMessage(F("Wi-Fi connected"), WiFi.localIP().toString());
    if (MDNS.begin(HOSTNAME)) {
      MDNS.addService("http", "tcp", 80);
      Serial.printf("[MDNS] http://%s.local/\n", HOSTNAME);
    }
    configTime(TIMEZONE, NTP_SERVER_1, NTP_SERVER_2);
    Serial.println(F("[TIME] NTP synchronization started"));
    return;
  }

  WiFi.disconnect();
  WiFi.mode(WIFI_AP);
  apMode = WiFi.softAP("Plant-Watering-Setup", AP_PASSWORD);
  wifiSleeping = false;
  wifiWasConnected = false;
  wifiModeChangedAt = millis();
  systemMessage = apMode ? "Wi-Fi failed; setup access point active"
                         : "Wi-Fi and access point failed";
  Serial.printf("[WIFI] AP %s, IP=%s\n",
                apMode ? "started" : "failed",
                WiFi.softAPIP().toString().c_str());
  showStartupMessage(F("Setup AP active"), WiFi.softAPIP().toString());
}

void updateDisplay(uint32_t now) {
  if (!displayReady) {
    return;
  }

  if (pumpRunning || otaInProgress || otaRebootPending) {
    wakeDisplay(now);
  }
  if (displayOn && intervalElapsed(now, lastOledActivityAt,
                                   OLED_IDLE_TIMEOUT_MS)) {
    sleepDisplay();
    return;
  }
  if (!displayOn) {
    return;
  }

  display.clearDisplay();
  display.setCursor(0, 0);
  display.println(formattedOledDateTime());
  display.print(F("IP: "));
  display.println(currentIp());

  display.print(F("Mode: "));
  display.println(controlModeShortName());

  display.print(F("Soil:"));
  if (measurements.soilValid) {
    display.print(measurements.soilPercent);
    display.print(F("%"));
  } else {
    display.print(F("--"));
  }
  display.print(F(" Bat:"));
  display.print(measurements.batteryPercent);
  display.println(F("%"));

  if (pumpRunning) {
    display.print(F("Water #"));
    display.print(wateringRunCount);
    display.print(' ');
    display.println(pumpSourceName(lastPumpSource));
    display.print(F("Run "));
    display.print(formattedDuration(pumpElapsedMs(now)));
    display.print('/');
    display.println(formattedDuration(pumpRunMs));
    display.print(F("Left "));
    display.println(formattedDuration(pumpRemainingMs(now)));
  } else {
    display.print(F("Pump OFF Runs:"));
    display.println(wateringRunCount);
    const uint32_t startupHold = startupPumpHoldRemainingMs(now);
    const uint32_t pauseRemaining = wateringPauseRemainingMs(now);
    const uint32_t scheduled = scheduleRemainingMs(now);
    const uint32_t cooldown = cooldownRemainingMs(now);
    if (pauseRemaining > 0) {
      display.print(F("Paused "));
      display.println(pauseRemaining == UINT32_MAX
                          ? String(F("syncing"))
                          : formattedHoursMinutes(pauseRemaining));
    } else if (startupHold > 0) {
      display.print(F("Boot hold "));
      display.println(formattedDuration(startupHold));
    } else if (scheduleFallbackActive()) {
      display.print(F("Next "));
      display.println(formattedHoursMinutes(scheduled));
    } else if (cooldown > 0) {
      display.print(F("Soak "));
      display.println(formattedHoursMinutes(cooldown));
    } else {
      display.println(F("Ready"));
    }
  }
  display.display();
}

