SashaKyz/esp8266-plant-watering/src/main.cpp
void enterDeepSleepIfReady(uint32_t now) {
  if (!DEEP_SLEEP_ENABLED || pumpRunning || otaInProgress ||
      otaRebootPending || apMode || !timeIsSynced() ||
      now < AWAKE_WINDOW_MS) {
    return;
  }
  writePump(false);
  setRgb(false, false, false);
  saveRtcState();
  savePersistentState();
  showStartupMessage(F("Deep sleep"), F("Wake in 10 min"));
  delay(100);
  if (displayReady) {
    display.ssd1306_command(SSD1306_DISPLAYOFF);
  }
  WiFi.disconnect(true);
  delay(100);
  ESP.deepSleep(DEEP_SLEEP_DURATION_US, WAKE_RF_DEFAULT);
}

void printDiagnostics(uint32_t now) {
  Serial.printf(
      "[STATUS] uptime=%lus wifi=\"%s\" ip=%s soil=%d%% raw=%d valid=%s "
      "battery=%.3fV %d%% raw=%d pump=%s source=%s remaining=%lums "
      "cooldown=%lums mode=\"%s\" schedule_remaining=%lums oled=%s@0x%02X "
      "time=\"%s\" run_count=%lu message=\"%s\"\n",
      static_cast<unsigned long>(now / 1000U),
      wifiDescription().c_str(),
      currentIp().c_str(),
      measurements.soilPercent,
      measurements.soilRaw,
      measurements.soilValid ? "yes" : "no",
      measurements.batteryVoltage,
      measurements.batteryPercent,
      measurements.batteryRaw,
      pumpRunning ? "on" : "off",
      String(pumpSourceName(lastPumpSource)).c_str(),
      static_cast<unsigned long>(pumpRemainingMs(now)),
      static_cast<unsigned long>(cooldownRemainingMs(now)),
      String(controlModeName()).c_str(),
      static_cast<unsigned long>(scheduleRemainingMs(now)),
      displayReady ? "ready" : "missing",
      activeOledAddress,
      formattedDateTime().c_str(),
      static_cast<unsigned long>(wateringRunCount),
      systemMessage.c_str());
}

}  // namespace

void setup() {
  Serial.begin(115200);
  Serial.println();
  Serial.println(F("[BOOT] ESP8266 plant watering controller"));
  wokeFromDeepSleep = ESP.getResetReason().indexOf(F("Deep-Sleep")) >= 0;
  loadRtcState();
  loadPersistentState();

  pinMode(PUMP_PIN, OUTPUT);
  writePump(false);
  pinMode(LED_RED_PIN, OUTPUT);
  pinMode(LED_GREEN_PIN, OUTPUT);
  if (!DEEP_SLEEP_ENABLED) {
    pinMode(LED_BLUE_PIN, OUTPUT);
  }
  setRgb(false, false, false);

  if (OLED_RESET_PIN >= 0) {
    pinMode(OLED_RESET_PIN, OUTPUT);
    digitalWrite(OLED_RESET_PIN, LOW);
    delay(10);
    digitalWrite(OLED_RESET_PIN, HIGH);
    delay(20);
  }

  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);
  Wire.setClock(100000);
  Wire.setClockStretchLimit(I2C_CLOCK_STRETCH_LIMIT_US);
  delay(50);
  i2cBusAvailable = checkI2cBusLines();
  scanI2cBus();
  activeOledAddress = detectOledAddress();
  displayReady = activeOledAddress != 0 &&
      display.begin(SSD1306_SWITCHCAPVCC, activeOledAddress, true, false);
  if (displayReady) {
    displayOn = true;
    lastOledActivityAt = millis();
    display.setTextSize(1);
    display.setTextColor(SSD1306_WHITE);
    display.setTextWrap(false);
    display.setRotation(OLED_ROTATION);
    showStartupMessage(F("Plant controller"), F("Starting..."));
    Serial.printf("[OLED] Ready at 0x%02X, %ux%u, rotation=%u\n",
                  activeOledAddress, OLED_WIDTH, OLED_HEIGHT, OLED_ROTATION);
  } else {
    Serial.println(
        F("[OLED] SSD1306 not detected at 0x3C/0x3D; check wiring or controller type"));
  }

  adsReady = i2cBusAvailable && ads.begin(ADS1115_ADDRESS);
  if (adsReady) {
    ads.setGain(GAIN_ONE);
    Serial.println(F("[SOIL] ADS1115 ready"));
  } else {
    Serial.println(F("[SOIL] ADS1115 not found"));
  }

  readSensors();
  connectNetwork();
  if (serverSyncConfigured() && WiFi.status() == WL_CONNECTED) {
    serverSyncDue = true;
  }
  setupWebServer();
  delay(500);
}

void loop() {
  uint32_t now = millis();
  bool sensorSampleTaken = false;
  updateWifiPower(now);
  if (!wifiSleeping) {
    server.handleClient();
  }
  now = millis();
  if (otaRebootPending && intervalElapsed(now, otaRebootAt, 1000)) {
    writePump(false);
    Serial.println(F("[OTA] Restarting"));
    Serial.flush();
    ESP.restart();
  }
  if (!wifiSleeping && !apMode && WiFi.status() == WL_CONNECTED) {
    MDNS.update();
  }

  const bool forceServerSync = serverSyncDue && serverSyncConfigured() &&
      !wifiSleeping && !apMode && WiFi.status() == WL_CONNECTED &&
      !pumpRunning && !otaInProgress && !otaRebootPending;
  if (forceServerSync) {
    serverSyncDue = false;
    lastSensorAt = now;
    readSensors();
    sensorSampleTaken = true;
  } else if (intervalElapsed(now, lastSensorAt, activeSensorIntervalMs)) {
    lastSensorAt = now;
    readSensors();
    sensorSampleTaken = true;
  }

  if (sensorSampleTaken) {
    syncWithServer(now, forceServerSync);
  }

  updatePumpControl(now, sensorSampleTaken);
  updateStatusLed(now);

  if (intervalElapsed(now, lastDisplayAt, DISPLAY_INTERVAL_MS)) {
    lastDisplayAt = now;
    updateDisplay(now);
  }

  if (intervalElapsed(now, lastSerialAt, SERIAL_INTERVAL_MS)) {
    lastSerialAt = now;
    printDiagnostics(now);
  }

  if (intervalElapsed(now, lastPersistentSaveAt,
                      PERSISTENT_STATE_SAVE_INTERVAL_MS)) {
    savePersistentState();
  }

  enterDeepSleepIfReady(now);

  yield();
}
